# Pandas

### Key code lines

In [ ]:
len(str), sum(rows)->count, 
X = df.iloc[:,:-1] #except last column
y = df.iloc[:,-1] #last column
df_result = pd.concat([X,y], axis=1) # column merge X,y
df.columns = ['a', 'b'] # Reassign column name
df.rename(columns={'oldName1': 'newName1', 'oldName2': 'newName2'}, inplace=True)
df.columns = df.iloc[0] # set first row as column name
df.reindex(df.index.drop(1))
df.drop(0) # delete first row
sal.groupby('Year').mean()['BasePay']
df.loc[['A','B'],['W','Y']] #Columns selection df[['W', 'Z']]  or df.loc[:,['W','Y']] 
df[(df['W']>0) & (df['Y'] > 1)] # can not use Python operator due to ambiguous values in truth series. | is for or
df.reset_index()
df = df.set_index('States') # df.set_index('States',inplace=True)
df['A'].fillna(value=df['A'].mean(),inplace=True) #missing value
df.loc[:, 'col1'] = df['col1'].apply(lambda x: x *2) # or .apply(times2)
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)#How many Job Titles were represented by only one person in 2013?
new_list = [expression(i) for i in x if i%2 == 0]  #list comprehension
sal['title_len'] = sal['JobTitle'].apply(len) # add new column for length
sal[['title_len','TotalPayBenefits']].corr() # to check correlation.

## Series

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a **Series can have axis labels**, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [3]:
#List => series
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
#numpy Array => series
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
#Dictionary => series
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an Index

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [10]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser1['USSR']

3

In [12]:
ser1[1]

2

In [13]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [14]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [15]:
ser1 + ser2 # unmatched labels are sumed as NaN

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Data Frames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. It gives Excel like feel.

In [16]:
from numpy.random import randn
np.random.seed(101) # so that same result can be repeated

In [17]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.W  # or df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
#Columns selection
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [21]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [22]:
df['new'] = df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

** Removing Columns**

In [24]:
df.drop('new',axis=1)  # Row axis = 0, Column axis = 1
#df.drop('E',axis=0)  #row drop

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [28]:
df.drop('new',axis=1,inplace=True)

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

** Selecting Rows**

In [30]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
#Or select based off of position instead of label
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

**Slice notation**
```
X = df.iloc[:,:-1] #except last column
y = df.iloc[:,-1] #last column
```
Syntex
```
a[start:end] # items start through end-1
a[start:]    # items start through the rest of the array
a[:end]      # items from the beginning through end-1
a[:]         # a copy of the whole array
```

There is also the `step` value, which can be used with any of the above:

```
a[start:end:step] # start through not past end, by step
```

The key point to remember is that the `:end` value represents the first value that is *not* in the selected slice. So, the difference beween `end` and `start` is the number of elements selected (if `step` is 1, the default).

The other feature is that `start` or `end` may be a *negative* number, which means it counts from the end of the array instead of the beginning. So:

```
a[-1]    # last item(row) in the array
a[-2:]   # last two items(rows) in the array
a[:-2]   # everything except the last two items(rows)
```

Similarly, `step` may be a negative number:

```
a[::-1]    # all items in the array, reversed
a[1::-1]   # the first two items, reversed
a[:-3:-1]  # the last two items, reversed
a[-3::-1]  # everything except the last two items, reversed
```

Python is kind to the programmer if there are fewer items than you ask for. For example, if you ask for `a[:-2]` and `a` only contains one element, you get an empty list instead of an error. Sometimes you would prefer the error, so you have to be aware that this may happen.

**Selecting subset of rows and columns**

In [32]:
df.loc['B','Y']

-0.8480769834036315

In [33]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [34]:
#[list of rows, list of columns]
df.loc[['A','B'],['W','Y']] #Columns selection df[['W', 'Z']]  or df.loc[:,['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.shape

(5, 4)

In [37]:
df>0 # If dataframe cell value is greater than 0 then true

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [38]:
df[df>0] # false values will be replaced by NaN

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [40]:
df[df['W']>0] # returns only rows with W column true values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [42]:
df[(df['W']>0) & (df['Y'] > 1)] # can not use Python operator due to ambiguous values in truth series. | is for or

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [46]:
#df.drop('States', axis=1, inplace=True)
newind = 'CA NY WY OR CO'.split()
df['States'] = newind

***Reset Index***

In [44]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [47]:
df = df.set_index('States') # df.set_index('States',inplace=True)
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Missing Data

In [49]:
df_m = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [50]:
df_m

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [51]:
df_m.dropna() # drop rows with null value

     A    B  C
0  1.0  5.0  1

In [100]:
df_m.dropna(subset = ['A', 'B'])  #******************************IMP

     A    B  C
0  1.0  5.0  1

In [99]:
df_m[np.isfinite(df_m['A'])]  # Take rows for column 'A' have finite vcalues

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [53]:
df_m.dropna(axis=1) # drop column with null value

   C
0  1
1  2
2  3

In [54]:
df_m.dropna(thresh=2) # Threshold. Remove if NA values >= threshold

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [55]:
df_m.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [101]:
df_m['A'].fillna(value=df_m['A'].mean(),inplace=True)

In [103]:
df_m

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# Group By

In [58]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [59]:
df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [60]:
by_comp = df1.groupby("Company")

In [70]:
by_comp

In [62]:
# Pandas ignores non numeric columns
by_comp.mean()  # or df1.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [72]:
df1.groupby('Company').sum().loc['FB'] # sum of facebook

Sales    593
Name: FB, dtype: int64

In [63]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [64]:
by_comp.min()  # In Min/Max python sorts alphanumeric column and return

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [65]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [66]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [67]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [68]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [69]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [74]:
df1.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining, and Concatenating

In [75]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [76]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [77]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [78]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [79]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [80]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation
glues together DataFrames. dimensions should match

In [82]:
pd.concat([df1,df2,df3])  #axis 0 - rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [83]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging
merge DataFrames together using a similar logic as merging SQL Tables together on some key

In [89]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K0'],
                          'C': ['C0', 'C1', 'C2', 'C3','C00'],
                          'D': ['D0', 'D1', 'D2', 'D3', 'D00']})

In [86]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [90]:
right

  key    C    D
0  K0   C0   D0
1  K1   C1   D1
2  K2   C2   D2
3  K3   C3   D3
4  K0  C00  D00

In [91]:
pd.merge(left,right,how='inner',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K0  A0  B0  C00  D00
2  K1  A1  B1   C1   D1
3  K2  A2  B2   C2   D2
4  K3  A3  B3   C3   D3

### Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [92]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [93]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [95]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [96]:
left.join(right) # inner join on index

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [97]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

In [118]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### unique

In [119]:
df['col2'].unique()

array([444, 555, 666])

In [120]:
df['col2'].nunique()

3

In [121]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Selecting Data

In [122]:
df[(df['col1']>2) | (df['col3']=='abc')]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

#### apply

apply works on a row / column basis of a DataFrame, applymap works element-wise on a DataFrame, and map works element-wise on a Series.
https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas

In [123]:
def times2(x):
    return x*2

In [124]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [125]:
df.loc[:, 'col1'] = df['col1'].apply(lambda x: x *2)
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  xyz

#### Sorting and Ordering a DataFrame:

In [127]:
df.sort_values(by='col2') #inplace=False by default

   col1  col2 col3
0     2   444  abc
3     8   444  xyz
1     4   555  def
2     6   666  ghi

***Other Methods***

df.columns, df.index, df.isnull(), df.dropna(), df.fillna('FILL'), df.pivot_table

# RnD >>>>

In [128]:
df = pd.DataFrame({'col1 tt':[1,2,3,4],'col2 tt1':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1 tt  col2 tt1 col3
0        1       444  abc
1        2       555  def
2        3       666  ghi
3        4       444  xyz

In [129]:
df.rename(columns=lambda x: x.replace(' ', ''), inplace=False) #Rename columns

   col1tt  col2tt1 col3
0       1      444  abc
1       2      555  def
2       3      666  ghi
3       4      444  xyz

***Set first row as column***

In [159]:
#Set first row as column
df = pd.DataFrame([('foo','bar','baz'), (1,2,3), (4,5,6)])
df

     0    1    2
0  foo  bar  baz
1    1    2    3
2    4    5    6

In [160]:
df.columns = df.iloc[0]
df.reindex(df.index.drop(1))
df

0  foo  bar  baz
0  foo  bar  baz
1    1    2    3
2    4    5    6

In [161]:
df.drop(0)

0 foo bar baz
1   1   2   3
2   4   5   6

In [134]:
df['foo']

0      1
1    foo
2      4
Name: foo, dtype: object

# Data input Output

* CSV
* Excel
* HTML
    * conda install lxml
    * conda install html5lib
    * conda install BeautifulSoup4
* SQL

In [162]:
pwd

'/Users/mk194903/Desktop/Projects/ML/Jupyter/PySpark_Python-ML-Models'

In [164]:
df = pd.read_csv('dataset/iris.csv')
df.head()
# df.to_csv('example',index=False)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0.0
1,4.9,3.0,1.4,0.2,0.0
2,4.7,3.2,1.3,0.2,0.0
3,4.6,3.1,1.5,0.2,0.0
4,5.0,3.6,1.4,0.2,0.0

In [ ]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')
# df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [ ]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df[0]

***SQL***
Can import from SQL lite